linux和它的小伙伴/既生xargs何生parallel.org
* xargs 不支持context替换
parallel 的 =-X= 选项可以让 ={}= 替换成命令行参数允许的最多参数值，若并发运行多个任务，则这些参数会被平均地分给每个任务，这种多参数的替换被称为context替换。例如

#+begin_src shell :results org
  seq 1 123|parallel -X -I{} echo {}
#+end_src

#+RESULTS:
#+begin_src org
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31
32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62
63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93
94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123
#+end_src

