linux和它的小伙伴/既生xargs何生parallel.org
* xargs使用 -I 选项时，只能替代一个参数.
xargs的 =-I= 选项默认了 =-L 1=,也就是说每个命令行只能使用最多一行输入作为参数。

而parallel中没有这个限制
#+begin_src shell :results org
  ls |parallel -I{} -l 2 echo 
#+end_src

#+RESULTS:
#+begin_src org
安全的SSH设置.org 把archwiki搬回家.org
把Orange Pi打造成多功能下载机.org 把Orange Pi打造成影音云存储服务器.org
把Orange Pi打造成AirPlay无线音响.org 把Orange Pi打造成git服务器.org
把OrangePiLite打造成shadowsocks服务器.org 把Orange Pi Lite打造成ubuntu server.org
保护容器部署安全的一些技巧.org 保护隐私的日常方法.org
保证linux登陆密码的质量.org 被误用的svn checkout.org
编写ansible playbook的一些注意事项.org 编译linux kernel.org
不死的sed.org 查看端口占用进程的几种方法.org
查找断开的符号链接.org 查找某个文件属于哪个package的方法.org
常用的8个第三方YUM源.org 程序员使用的gedit配置.org
创建无法用cat显示的文件.org 创建Docker Swarm集群.org
创建UEFI分区时的注意事项.org 从Linux ISO文件启动计算机.org
对比本地文件与远程文件的方法.org 发现一个下载APK的好网站.org
发现一个在线体验各个Linux发行版的网站.org 给gedit加上Docker语法高亮.org
更改slack-desktop的显示图标.org 更换Linux UID.org
关闭firefox的全屏提示.org 获取系统物理地址的方法.org
既生xargs何生parallel.org 检查linux命令是否存在的正确方式.org
将视频转换成gif的方法.org 将OrangePi打造成中央日志服务器.org
将OrangePiLite打造成BT下载服务器.org 解决orangepi lite刷官网ubuntu-server 不能apt update的问题.org
禁用BEEP的方法.org 禁用Ctrl-Alt-Del重启系统.org
禁用ROOT的4种方法.org 拷贝一个文件到多个目录的几种方法.org
利用linux清空Windows登陆密码.org 连接Android手机到ArchLinux上.org
命令的执行环境.org 命令行查看GPU内存容量.org
命令行查看GPU信息.org 目录跳转神器z的实现原理和使用方法.org
排查SSH X11 Forwarding无效的步骤.org 配置SFTP Server.org
启用EPEL源并为yum操作设置代理服务器的方法.org 强制ssh使用密码认证登陆服务器.org
清空docker container logs.org 取消grep和awk的缓存.org
让你的终端雪花飞舞.org 让pacman无处不在.org
让ssh从stdin读取密码.org 如何保留命令替换结果中的换行符.org
如何保证Dockerfile每次都能产生完全相同的镜像.org 如何编写bash completion script.org
如何不使用第三方工具查看笔记本的电量还剩多少.org 如何查看打开指定文件的进程.org
如何查看进程的内存占用量.org 如何创建最小的容器镜像.org
如何多用户共享tmux session.org 如何防止意外重启Linux(基于systemd).org
如何复制文件的权限和所属关系.org 如何更改分区的UUDI.org
如何更改crontab任务结果的邮件接收人.org 如何计算umask的效果.org
如何加载linux kernel module.org 如何禁用history.org
如何禁止普通用户查看dmesg信息.org 如何判断一个进程是计算密集型还是IO密集型.org
如何让docker容器中的应用播放声音.org 如何设置容器中的时区.org
如何使用sudo命令来添加内容到文件中.org 如何通过shell找到SDCard的路径.org
如何退出无响应的ssh会话.org 如何向其他用户隐藏进程信息.org
如何修改新版gnome-terminal的标题.org 如何在容器中访问host中的DBus.org
如何在archlinux上安装RPM包.org 如何在Docker容器中启动D-Bus.org
如何在linux上安装新字体.org 如何在Linux上查看RAM信息.org
如何在xargs中使用自定义函数.org 如何kill一个进程组或会话.org
删除文件时发生了些什么事情.org 设置sudo的超时时间.org
十大GitHub最佳实践.org 实现shell版的pv.org
识别文件格式的那些工具.org 使用管道要注意的几个点.org
使用AIDE进行侵入检查.org 使用anacron定期执行任务.org
使用aspell检查英文拼写错误.org 使用avfs直接挂载压缩文件.org
使用bash随机更换壁纸.org 使用bash-it重新规划bash配置.org
使用blueman连接蓝牙设备.org 使用Calibre移除电子书中的DRM.org
使用CDPATH简化cd命令中的路径.org 使用chattr实现对文件属性的精细化管理.org
使用chrt修改进程调度策略及优先级.org 使用column格式化输出.org
使用cryptmount创建加密镜像保存机密文件.org 使用cryptsetup创建加密磁盘.org
使用date进行日期之间的计算.org 使用datefudge锁定测试时间.org
使用dd从png文件中分离附加数据.org 使用declare保存函数定义.org
使用dmidecode检查常见的硬件信息.org 使用DosBox运行dos游戏的简易方法.org
使用dpkg-reconfigure重新配置已安装好的应用.org 使用endlessh来保护你的ssh服务.org
使用Exodus在不同linux之前迁移应用.org 使用fbi在终端查看图片.org
使用feh快速设置桌面壁纸.org 使用ffmpeg进行视频转码，剪切，合并与调速.org
使用file命令识别磁盘文件格式.org 使用file命令识别文件字符编码格式.org
使用foremost恢复已删除文件.org 使用gbkunzip解决linux下zip文件解压乱码问题.org
使用git的一些小技巧.org 使用inotify-tools与rsync构建实时备份系统.org
使用iw连接无线网络.org 使用journalctl查看systemd日志.org
使用jq组装JSON.org 使用libreoffice批量转换文件和打印.org
使用logsave将命令输出保存起来.org 使用losetup帮你创建虚拟磁盘.org
使用lshw读取硬件信息.org 使用lynis进行linux漏洞扫描.org
使用mdadm设置RAID.org 使用mkisofs将指定目录做成ISO镜像.org
使用netctl设置无线网络.org 使用nmap进行网络发现.org
使用notify-send发送桌面通知.org 使用nslookup和nc验证email地址的有效性.org
使用parallel加速单线程程序.org 使用partclone备份磁盘分区.org
使用ping命令来探测目标主机的操作系统类型.org 使用Privoxy将Sock5代理转换成HTTP代理.org
使用redshift保护你的睡眠质量.org 使用rename批量重命名文件.org
使用rga在pdf中搜索关键字.org 使用rtcwake定时唤醒linux.org
使用scrcpy控制你的手机.org 使用shell察看OrangePi的温度.org
使用shell构建多进程的commandlinefu爬虫.org 使用shell控制OrangePi的发光二极管.org
使用shell切换触摸板的方法.org 使用shred彻底删除文件.org
使用snap在archlinux上安装skype.org 使用source命令的注意事项.org
使用ssh-key-gen清理无效的known_hosts记录.org 使用strace探索tail -f的工作机制.org
使用stress进行压力测试.org 使用tar代替cp进行拷贝.org
使用Termux把Android手机变成SSH服务器.org 使用timedatectl进行时间设置.org
使用tlp优化电池消耗.org 使用Toolbox构建容器中的开发环境(无需root权限).org
使用tput创建屏幕输出.org 使用unrar解压分片rar压缩文件.org
使用watch帮你重复执行命令.org 使用xrandr在命令行调整屏幕亮度.org
使用zdump显示不同时区的当前时间.org 使用ZSWAP改善低内存电脑的性能.org
提高libreoffice效率的小窍门.org 体验libvirt虚拟机.org
通过SSH锻炼你的bash技能.org 为什么说创建docker用户组不是个好选择.org
为什么cat命令查看文件不会修改atime.org 为Archlinux安装Android双启动.org
为history加上时间戳.org 为Linux安装杀毒软件.org
为OpenSSH开启双因素认证.org 为urxvt设置背景图片.org
我的linux终端工具.org 我所不知道的printf命令特性.org
误删除dev下特殊文件怎么办.org 小指头的妙用.org
修复passwd:Authentication token manipulation error的步骤.org 一个分析正则表达式的好网站.org
一个显示中文格言的fortune文件.org 一个学习SQL的网站.org
一行命令把OrangePi打造成文件云服务器.org 一行命令实现url decode.org
用mpg123播放https_url_mp3.org 用Termux模拟Ubuntu.org
运行tail|grep后按下Ctrl-C的过程中发生了什么.org 在容器中运行Linux版百度云盘客户端.org
在容器中运行Linux版QQ.org 在archlinux安装配置VNC Server.org
在Archlinux上安装和使用Tripwire IDS.org 在archlinux上安装deb包.org
在archlinux上挂载virtualbox磁盘镜像文件.org 在Archlinux上进行时钟同步.org
在Archlinux下安装和使用Skype.org 在archlinux中使用蓝牙耳机.org
在docker容器中分享敏感信息的方法.org 在Docker中运行Steam.org
在DosBox上安装windows3.2.org 在Linux上搭建UO服务器.org
在OrangePi上安装Lychee进行照片管理.org 在OrangePi上使用Docker-Compose搭建蚂蚁笔记服务器.org
在OrangePi上运行DOS程序.org 在shell中快速跳转到常用目录.org
在Termux中模拟root.org 在Ubuntu上安装RPM包.org
终端环境使用w3m访问视频站点的正确方式.org 重建CentOS或RHEL上被损坏的RPM数据库.org
尊重隐私的搜索引擎.org AIX行vi打开大文件时提示"Out of memory saving lines for undo"的解决方法.org
archlinux安装nvidia驱动.org archlinux开启指纹登陆.org
archlinux如何降级安装软件包.org archlinux使用virtualbox的几个要点.org
awesomewm配置.org AwesomeWM中的client.org
Bash挑战赛.org bash中的扩展通配符.org
Bash中的那些快捷键.org Bash中的那些有趣的内置变量.org
Bash中的keymap与bind命令.org Basic Setup and Installation of DosBox.org
bitlbee.org btrfs文件系统管理.org
cdspell帮你自动更正cd命令中的错误目录.org control.tar.gz
ctop_manage_container.org curl练习.org
data.tar.xz deb文件的格式.org
debian-binary DeDRM_tools_6.6.1.zip
DICTD:构建自己的字典服务器.org docker容器中跑GUI的最简单方法.org
docker-machine初体验.org ext4 tips三则.org
Firefox提示插件认证过期的解决方法.org Firefox一次关闭多个标签页.org
funny-manpages.org git导出排除指定文件的方法.org
git练习.org git tips之只提交文件中的某些变更.org
GLOBIGNORE变量的意义.org grub2常用命令.org
images install:增强版的cp命令.org
kgotobed让你强制早睡.org kile编译时提示 ViewPDF failed to start的解决方法.org
linux定时休眠.org Linux挂载BitLocker加密的Windows分区.org
linux内存的分配和释放.org linux如何更改网卡MAC地址.org
linux如何设置时区.org linux是如何记录日志的.org
Linux下的那些教育类软件集合.org linux下的SysRq键.org
linux下rar文件常用操作.org linux中网络相关的那些配置文件.org
linux重要日志说明.org linuxbrew让你在home目录下安装应用.org
linux IO子系统概览.org linux shell flock文件锁的用法及注意事项.org
ls对文件进行排序.org MBR与GPT分区表的简单说明.org
meminfo文件详解.org mpg123播放歌曲自动快进的解决方法.org
Newsboat：一款终端RSS阅读器.org nohup,setsid与disown的不同之处.org
numfmt:让数字变得更容易理解.org pacman中的Pac-Man.org
pamac:让你轻松管理软件包.org peek:一款简易的gif录屏软件.org
reinstall-arch.org rox-filer常用操作.org
SDCV:终端上的星际译王.org sed中的alpha到底包含哪些字符.org
shell中的那些初始化文件.org shell中如何将其他进制数转换成10进制数.org
sl-modem-daemon_2.9.11~20110321-12_i386.deb ssh端口转发说明.org
ssh使用跳板机访问远程服务器.org ssh远程执行脚本后无返回的解决方法.org
sshtron让你在终端玩的多人贪吃蛇.org termux-api让你的Termux访问手机系统功能.org
tload:字符界面上的图形化系统负载监控工具.org Tmux常用操作说明.org
Ubuntu16.04升级到18.04的步骤.org Ubuntu使用apt安装本地deb软件包.org
unzip常用方法.org urandom和random设备的区别.org
Vagrant使用指南.org w3m常用操作.org
what-is-double-slash-foo-directory.org wsl手工挂载U盘.org
xfs文件系统管理.org xterm使用简介.org
yum提示“DB_RUNRECOVERY Fatal error, run database recovery”的解决方案.org z.sh
#+end_src

