blog/2020/04/01/既生xargs何生parallel/index.html

<div id="outline-container-orgc2ed051" class="outline-2">
<h2 id="orgc2ed051">xargs使用 -I 选项时，只能替代一个参数.</h2>
<div class="outline-text-2" id="text-orgc2ed051">
<p>
xargs的 <code>-I</code> 选项默认了 <code>-L 1</code>,也就是说每个命令行只能使用最多一行输入作为参数。
</p>

<p>
而parallel中没有这个限制
</p>
<div class="org-src-container">
<pre class="src src-shell">ls |parallel -I{} -l 2 echo 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">&#23433;&#20840;&#30340;SSH&#35774;&#32622;.org &#25226;archwiki&#25644;&#22238;&#23478;.org
&#25226;Orange Pi&#25171;&#36896;&#25104;&#22810;&#21151;&#33021;&#19979;&#36733;&#26426;.org &#25226;Orange Pi&#25171;&#36896;&#25104;&#24433;&#38899;&#20113;&#23384;&#20648;&#26381;&#21153;&#22120;.org
&#25226;Orange Pi&#25171;&#36896;&#25104;AirPlay&#26080;&#32447;&#38899;&#21709;.org &#25226;Orange Pi&#25171;&#36896;&#25104;git&#26381;&#21153;&#22120;.org
&#25226;OrangePiLite&#25171;&#36896;&#25104;shadowsocks&#26381;&#21153;&#22120;.org &#25226;Orange Pi Lite&#25171;&#36896;&#25104;ubuntu server.org
&#20445;&#25252;&#23481;&#22120;&#37096;&#32626;&#23433;&#20840;&#30340;&#19968;&#20123;&#25216;&#24039;.org &#20445;&#25252;&#38544;&#31169;&#30340;&#26085;&#24120;&#26041;&#27861;.org
&#20445;&#35777;linux&#30331;&#38470;&#23494;&#30721;&#30340;&#36136;&#37327;.org &#34987;&#35823;&#29992;&#30340;svn checkout.org
&#32534;&#20889;ansible playbook&#30340;&#19968;&#20123;&#27880;&#24847;&#20107;&#39033;.org &#32534;&#35793;linux kernel.org
&#19981;&#27515;&#30340;sed.org &#26597;&#30475;&#31471;&#21475;&#21344;&#29992;&#36827;&#31243;&#30340;&#20960;&#31181;&#26041;&#27861;.org
&#26597;&#25214;&#26029;&#24320;&#30340;&#31526;&#21495;&#38142;&#25509;.org &#26597;&#25214;&#26576;&#20010;&#25991;&#20214;&#23646;&#20110;&#21738;&#20010;package&#30340;&#26041;&#27861;.org
&#24120;&#29992;&#30340;8&#20010;&#31532;&#19977;&#26041;YUM&#28304;.org &#31243;&#24207;&#21592;&#20351;&#29992;&#30340;gedit&#37197;&#32622;.org
&#21019;&#24314;&#26080;&#27861;&#29992;cat&#26174;&#31034;&#30340;&#25991;&#20214;.org &#21019;&#24314;Docker Swarm&#38598;&#32676;.org
&#21019;&#24314;UEFI&#20998;&#21306;&#26102;&#30340;&#27880;&#24847;&#20107;&#39033;.org &#20174;Linux ISO&#25991;&#20214;&#21551;&#21160;&#35745;&#31639;&#26426;.org
&#23545;&#27604;&#26412;&#22320;&#25991;&#20214;&#19982;&#36828;&#31243;&#25991;&#20214;&#30340;&#26041;&#27861;.org &#21457;&#29616;&#19968;&#20010;&#19979;&#36733;APK&#30340;&#22909;&#32593;&#31449;.org
&#21457;&#29616;&#19968;&#20010;&#22312;&#32447;&#20307;&#39564;&#21508;&#20010;Linux&#21457;&#34892;&#29256;&#30340;&#32593;&#31449;.org &#32473;gedit&#21152;&#19978;Docker&#35821;&#27861;&#39640;&#20142;.org
&#26356;&#25913;slack-desktop&#30340;&#26174;&#31034;&#22270;&#26631;.org &#26356;&#25442;Linux UID.org
&#20851;&#38381;firefox&#30340;&#20840;&#23631;&#25552;&#31034;.org &#33719;&#21462;&#31995;&#32479;&#29289;&#29702;&#22320;&#22336;&#30340;&#26041;&#27861;.org
&#26082;&#29983;xargs&#20309;&#29983;parallel.org &#26816;&#26597;linux&#21629;&#20196;&#26159;&#21542;&#23384;&#22312;&#30340;&#27491;&#30830;&#26041;&#24335;.org
&#23558;&#35270;&#39057;&#36716;&#25442;&#25104;gif&#30340;&#26041;&#27861;.org &#23558;OrangePi&#25171;&#36896;&#25104;&#20013;&#22830;&#26085;&#24535;&#26381;&#21153;&#22120;.org
&#23558;OrangePiLite&#25171;&#36896;&#25104;BT&#19979;&#36733;&#26381;&#21153;&#22120;.org &#35299;&#20915;orangepi lite&#21047;&#23448;&#32593;ubuntu-server &#19981;&#33021;apt update&#30340;&#38382;&#39064;.org
&#31105;&#29992;BEEP&#30340;&#26041;&#27861;.org &#31105;&#29992;Ctrl-Alt-Del&#37325;&#21551;&#31995;&#32479;.org
&#31105;&#29992;ROOT&#30340;4&#31181;&#26041;&#27861;.org &#25335;&#36125;&#19968;&#20010;&#25991;&#20214;&#21040;&#22810;&#20010;&#30446;&#24405;&#30340;&#20960;&#31181;&#26041;&#27861;.org
&#21033;&#29992;linux&#28165;&#31354;Windows&#30331;&#38470;&#23494;&#30721;.org &#36830;&#25509;Android&#25163;&#26426;&#21040;ArchLinux&#19978;.org
&#21629;&#20196;&#30340;&#25191;&#34892;&#29615;&#22659;.org &#21629;&#20196;&#34892;&#26597;&#30475;GPU&#20869;&#23384;&#23481;&#37327;.org
&#21629;&#20196;&#34892;&#26597;&#30475;GPU&#20449;&#24687;.org &#30446;&#24405;&#36339;&#36716;&#31070;&#22120;z&#30340;&#23454;&#29616;&#21407;&#29702;&#21644;&#20351;&#29992;&#26041;&#27861;.org
&#25490;&#26597;SSH X11 Forwarding&#26080;&#25928;&#30340;&#27493;&#39588;.org &#37197;&#32622;SFTP Server.org
&#21551;&#29992;EPEL&#28304;&#24182;&#20026;yum&#25805;&#20316;&#35774;&#32622;&#20195;&#29702;&#26381;&#21153;&#22120;&#30340;&#26041;&#27861;.org &#24378;&#21046;ssh&#20351;&#29992;&#23494;&#30721;&#35748;&#35777;&#30331;&#38470;&#26381;&#21153;&#22120;.org
&#28165;&#31354;docker container logs.org &#21462;&#28040;grep&#21644;awk&#30340;&#32531;&#23384;.org
&#35753;&#20320;&#30340;&#32456;&#31471;&#38634;&#33457;&#39134;&#33310;.org &#35753;pacman&#26080;&#22788;&#19981;&#22312;.org
&#35753;ssh&#20174;stdin&#35835;&#21462;&#23494;&#30721;.org &#22914;&#20309;&#20445;&#30041;&#21629;&#20196;&#26367;&#25442;&#32467;&#26524;&#20013;&#30340;&#25442;&#34892;&#31526;.org
&#22914;&#20309;&#20445;&#35777;Dockerfile&#27599;&#27425;&#37117;&#33021;&#20135;&#29983;&#23436;&#20840;&#30456;&#21516;&#30340;&#38236;&#20687;.org &#22914;&#20309;&#32534;&#20889;bash completion script.org
&#22914;&#20309;&#19981;&#20351;&#29992;&#31532;&#19977;&#26041;&#24037;&#20855;&#26597;&#30475;&#31508;&#35760;&#26412;&#30340;&#30005;&#37327;&#36824;&#21097;&#22810;&#23569;.org &#22914;&#20309;&#26597;&#30475;&#25171;&#24320;&#25351;&#23450;&#25991;&#20214;&#30340;&#36827;&#31243;.org
&#22914;&#20309;&#26597;&#30475;&#36827;&#31243;&#30340;&#20869;&#23384;&#21344;&#29992;&#37327;.org &#22914;&#20309;&#21019;&#24314;&#26368;&#23567;&#30340;&#23481;&#22120;&#38236;&#20687;.org
&#22914;&#20309;&#22810;&#29992;&#25143;&#20849;&#20139;tmux session.org &#22914;&#20309;&#38450;&#27490;&#24847;&#22806;&#37325;&#21551;Linux(&#22522;&#20110;systemd).org
&#22914;&#20309;&#22797;&#21046;&#25991;&#20214;&#30340;&#26435;&#38480;&#21644;&#25152;&#23646;&#20851;&#31995;.org &#22914;&#20309;&#26356;&#25913;&#20998;&#21306;&#30340;UUDI.org
&#22914;&#20309;&#26356;&#25913;crontab&#20219;&#21153;&#32467;&#26524;&#30340;&#37038;&#20214;&#25509;&#25910;&#20154;.org &#22914;&#20309;&#35745;&#31639;umask&#30340;&#25928;&#26524;.org
&#22914;&#20309;&#21152;&#36733;linux kernel module.org &#22914;&#20309;&#31105;&#29992;history.org
&#22914;&#20309;&#31105;&#27490;&#26222;&#36890;&#29992;&#25143;&#26597;&#30475;dmesg&#20449;&#24687;.org &#22914;&#20309;&#21028;&#26029;&#19968;&#20010;&#36827;&#31243;&#26159;&#35745;&#31639;&#23494;&#38598;&#22411;&#36824;&#26159;IO&#23494;&#38598;&#22411;.org
&#22914;&#20309;&#35753;docker&#23481;&#22120;&#20013;&#30340;&#24212;&#29992;&#25773;&#25918;&#22768;&#38899;.org &#22914;&#20309;&#35774;&#32622;&#23481;&#22120;&#20013;&#30340;&#26102;&#21306;.org
&#22914;&#20309;&#20351;&#29992;sudo&#21629;&#20196;&#26469;&#28155;&#21152;&#20869;&#23481;&#21040;&#25991;&#20214;&#20013;.org &#22914;&#20309;&#36890;&#36807;shell&#25214;&#21040;SDCard&#30340;&#36335;&#24452;.org
&#22914;&#20309;&#36864;&#20986;&#26080;&#21709;&#24212;&#30340;ssh&#20250;&#35805;.org &#22914;&#20309;&#21521;&#20854;&#20182;&#29992;&#25143;&#38544;&#34255;&#36827;&#31243;&#20449;&#24687;.org
&#22914;&#20309;&#20462;&#25913;&#26032;&#29256;gnome-terminal&#30340;&#26631;&#39064;.org &#22914;&#20309;&#22312;&#23481;&#22120;&#20013;&#35775;&#38382;host&#20013;&#30340;DBus.org
&#22914;&#20309;&#22312;archlinux&#19978;&#23433;&#35013;RPM&#21253;.org &#22914;&#20309;&#22312;Docker&#23481;&#22120;&#20013;&#21551;&#21160;D-Bus.org
&#22914;&#20309;&#22312;linux&#19978;&#23433;&#35013;&#26032;&#23383;&#20307;.org &#22914;&#20309;&#22312;Linux&#19978;&#26597;&#30475;RAM&#20449;&#24687;.org
&#22914;&#20309;&#22312;xargs&#20013;&#20351;&#29992;&#33258;&#23450;&#20041;&#20989;&#25968;.org &#22914;&#20309;kill&#19968;&#20010;&#36827;&#31243;&#32452;&#25110;&#20250;&#35805;.org
&#21024;&#38500;&#25991;&#20214;&#26102;&#21457;&#29983;&#20102;&#20123;&#20160;&#20040;&#20107;&#24773;.org &#35774;&#32622;sudo&#30340;&#36229;&#26102;&#26102;&#38388;.org
&#21313;&#22823;GitHub&#26368;&#20339;&#23454;&#36341;.org &#23454;&#29616;shell&#29256;&#30340;pv.org
&#35782;&#21035;&#25991;&#20214;&#26684;&#24335;&#30340;&#37027;&#20123;&#24037;&#20855;.org &#20351;&#29992;&#31649;&#36947;&#35201;&#27880;&#24847;&#30340;&#20960;&#20010;&#28857;.org
&#20351;&#29992;AIDE&#36827;&#34892;&#20405;&#20837;&#26816;&#26597;.org &#20351;&#29992;anacron&#23450;&#26399;&#25191;&#34892;&#20219;&#21153;.org
&#20351;&#29992;aspell&#26816;&#26597;&#33521;&#25991;&#25340;&#20889;&#38169;&#35823;.org &#20351;&#29992;avfs&#30452;&#25509;&#25346;&#36733;&#21387;&#32553;&#25991;&#20214;.org
&#20351;&#29992;bash&#38543;&#26426;&#26356;&#25442;&#22721;&#32440;.org &#20351;&#29992;bash-it&#37325;&#26032;&#35268;&#21010;bash&#37197;&#32622;.org
&#20351;&#29992;blueman&#36830;&#25509;&#34013;&#29273;&#35774;&#22791;.org &#20351;&#29992;Calibre&#31227;&#38500;&#30005;&#23376;&#20070;&#20013;&#30340;DRM.org
&#20351;&#29992;CDPATH&#31616;&#21270;cd&#21629;&#20196;&#20013;&#30340;&#36335;&#24452;.org &#20351;&#29992;chattr&#23454;&#29616;&#23545;&#25991;&#20214;&#23646;&#24615;&#30340;&#31934;&#32454;&#21270;&#31649;&#29702;.org
&#20351;&#29992;chrt&#20462;&#25913;&#36827;&#31243;&#35843;&#24230;&#31574;&#30053;&#21450;&#20248;&#20808;&#32423;.org &#20351;&#29992;column&#26684;&#24335;&#21270;&#36755;&#20986;.org
&#20351;&#29992;cryptmount&#21019;&#24314;&#21152;&#23494;&#38236;&#20687;&#20445;&#23384;&#26426;&#23494;&#25991;&#20214;.org &#20351;&#29992;cryptsetup&#21019;&#24314;&#21152;&#23494;&#30913;&#30424;.org
&#20351;&#29992;date&#36827;&#34892;&#26085;&#26399;&#20043;&#38388;&#30340;&#35745;&#31639;.org &#20351;&#29992;datefudge&#38145;&#23450;&#27979;&#35797;&#26102;&#38388;.org
&#20351;&#29992;dd&#20174;png&#25991;&#20214;&#20013;&#20998;&#31163;&#38468;&#21152;&#25968;&#25454;.org &#20351;&#29992;declare&#20445;&#23384;&#20989;&#25968;&#23450;&#20041;.org
&#20351;&#29992;dmidecode&#26816;&#26597;&#24120;&#35265;&#30340;&#30828;&#20214;&#20449;&#24687;.org &#20351;&#29992;DosBox&#36816;&#34892;dos&#28216;&#25103;&#30340;&#31616;&#26131;&#26041;&#27861;.org
&#20351;&#29992;dpkg-reconfigure&#37325;&#26032;&#37197;&#32622;&#24050;&#23433;&#35013;&#22909;&#30340;&#24212;&#29992;.org &#20351;&#29992;endlessh&#26469;&#20445;&#25252;&#20320;&#30340;ssh&#26381;&#21153;.org
&#20351;&#29992;Exodus&#22312;&#19981;&#21516;linux&#20043;&#21069;&#36801;&#31227;&#24212;&#29992;.org &#20351;&#29992;fbi&#22312;&#32456;&#31471;&#26597;&#30475;&#22270;&#29255;.org
&#20351;&#29992;feh&#24555;&#36895;&#35774;&#32622;&#26700;&#38754;&#22721;&#32440;.org &#20351;&#29992;ffmpeg&#36827;&#34892;&#35270;&#39057;&#36716;&#30721;&#65292;&#21098;&#20999;&#65292;&#21512;&#24182;&#19982;&#35843;&#36895;.org
&#20351;&#29992;file&#21629;&#20196;&#35782;&#21035;&#30913;&#30424;&#25991;&#20214;&#26684;&#24335;.org &#20351;&#29992;file&#21629;&#20196;&#35782;&#21035;&#25991;&#20214;&#23383;&#31526;&#32534;&#30721;&#26684;&#24335;.org
&#20351;&#29992;foremost&#24674;&#22797;&#24050;&#21024;&#38500;&#25991;&#20214;.org &#20351;&#29992;gbkunzip&#35299;&#20915;linux&#19979;zip&#25991;&#20214;&#35299;&#21387;&#20081;&#30721;&#38382;&#39064;.org
&#20351;&#29992;git&#30340;&#19968;&#20123;&#23567;&#25216;&#24039;.org &#20351;&#29992;inotify-tools&#19982;rsync&#26500;&#24314;&#23454;&#26102;&#22791;&#20221;&#31995;&#32479;.org
&#20351;&#29992;iw&#36830;&#25509;&#26080;&#32447;&#32593;&#32476;.org &#20351;&#29992;journalctl&#26597;&#30475;systemd&#26085;&#24535;.org
&#20351;&#29992;jq&#32452;&#35013;JSON.org &#20351;&#29992;libreoffice&#25209;&#37327;&#36716;&#25442;&#25991;&#20214;&#21644;&#25171;&#21360;.org
&#20351;&#29992;logsave&#23558;&#21629;&#20196;&#36755;&#20986;&#20445;&#23384;&#36215;&#26469;.org &#20351;&#29992;losetup&#24110;&#20320;&#21019;&#24314;&#34394;&#25311;&#30913;&#30424;.org
&#20351;&#29992;lshw&#35835;&#21462;&#30828;&#20214;&#20449;&#24687;.org &#20351;&#29992;lynis&#36827;&#34892;linux&#28431;&#27934;&#25195;&#25551;.org
&#20351;&#29992;mdadm&#35774;&#32622;RAID.org &#20351;&#29992;mkisofs&#23558;&#25351;&#23450;&#30446;&#24405;&#20570;&#25104;ISO&#38236;&#20687;.org
&#20351;&#29992;netctl&#35774;&#32622;&#26080;&#32447;&#32593;&#32476;.org &#20351;&#29992;nmap&#36827;&#34892;&#32593;&#32476;&#21457;&#29616;.org
&#20351;&#29992;notify-send&#21457;&#36865;&#26700;&#38754;&#36890;&#30693;.org &#20351;&#29992;nslookup&#21644;nc&#39564;&#35777;email&#22320;&#22336;&#30340;&#26377;&#25928;&#24615;.org
&#20351;&#29992;parallel&#21152;&#36895;&#21333;&#32447;&#31243;&#31243;&#24207;.org &#20351;&#29992;partclone&#22791;&#20221;&#30913;&#30424;&#20998;&#21306;.org
&#20351;&#29992;ping&#21629;&#20196;&#26469;&#25506;&#27979;&#30446;&#26631;&#20027;&#26426;&#30340;&#25805;&#20316;&#31995;&#32479;&#31867;&#22411;.org &#20351;&#29992;Privoxy&#23558;Sock5&#20195;&#29702;&#36716;&#25442;&#25104;HTTP&#20195;&#29702;.org
&#20351;&#29992;redshift&#20445;&#25252;&#20320;&#30340;&#30561;&#30496;&#36136;&#37327;.org &#20351;&#29992;rename&#25209;&#37327;&#37325;&#21629;&#21517;&#25991;&#20214;.org
&#20351;&#29992;rga&#22312;pdf&#20013;&#25628;&#32034;&#20851;&#38190;&#23383;.org &#20351;&#29992;rtcwake&#23450;&#26102;&#21796;&#37266;linux.org
&#20351;&#29992;scrcpy&#25511;&#21046;&#20320;&#30340;&#25163;&#26426;.org &#20351;&#29992;shell&#23519;&#30475;OrangePi&#30340;&#28201;&#24230;.org
&#20351;&#29992;shell&#26500;&#24314;&#22810;&#36827;&#31243;&#30340;commandlinefu&#29228;&#34411;.org &#20351;&#29992;shell&#25511;&#21046;OrangePi&#30340;&#21457;&#20809;&#20108;&#26497;&#31649;.org
&#20351;&#29992;shell&#20999;&#25442;&#35302;&#25720;&#26495;&#30340;&#26041;&#27861;.org &#20351;&#29992;shred&#24443;&#24213;&#21024;&#38500;&#25991;&#20214;.org
&#20351;&#29992;snap&#22312;archlinux&#19978;&#23433;&#35013;skype.org &#20351;&#29992;source&#21629;&#20196;&#30340;&#27880;&#24847;&#20107;&#39033;.org
&#20351;&#29992;ssh-key-gen&#28165;&#29702;&#26080;&#25928;&#30340;known_hosts&#35760;&#24405;.org &#20351;&#29992;strace&#25506;&#32034;tail -f&#30340;&#24037;&#20316;&#26426;&#21046;.org
&#20351;&#29992;stress&#36827;&#34892;&#21387;&#21147;&#27979;&#35797;.org &#20351;&#29992;tar&#20195;&#26367;cp&#36827;&#34892;&#25335;&#36125;.org
&#20351;&#29992;Termux&#25226;Android&#25163;&#26426;&#21464;&#25104;SSH&#26381;&#21153;&#22120;.org &#20351;&#29992;timedatectl&#36827;&#34892;&#26102;&#38388;&#35774;&#32622;.org
&#20351;&#29992;tlp&#20248;&#21270;&#30005;&#27744;&#28040;&#32791;.org &#20351;&#29992;Toolbox&#26500;&#24314;&#23481;&#22120;&#20013;&#30340;&#24320;&#21457;&#29615;&#22659;(&#26080;&#38656;root&#26435;&#38480;).org
&#20351;&#29992;tput&#21019;&#24314;&#23631;&#24149;&#36755;&#20986;.org &#20351;&#29992;unrar&#35299;&#21387;&#20998;&#29255;rar&#21387;&#32553;&#25991;&#20214;.org
&#20351;&#29992;watch&#24110;&#20320;&#37325;&#22797;&#25191;&#34892;&#21629;&#20196;.org &#20351;&#29992;xrandr&#22312;&#21629;&#20196;&#34892;&#35843;&#25972;&#23631;&#24149;&#20142;&#24230;.org
&#20351;&#29992;zdump&#26174;&#31034;&#19981;&#21516;&#26102;&#21306;&#30340;&#24403;&#21069;&#26102;&#38388;.org &#20351;&#29992;ZSWAP&#25913;&#21892;&#20302;&#20869;&#23384;&#30005;&#33041;&#30340;&#24615;&#33021;.org
&#25552;&#39640;libreoffice&#25928;&#29575;&#30340;&#23567;&#31373;&#38376;.org &#20307;&#39564;libvirt&#34394;&#25311;&#26426;.org
&#36890;&#36807;SSH&#38203;&#28860;&#20320;&#30340;bash&#25216;&#33021;.org &#20026;&#20160;&#20040;&#35828;&#21019;&#24314;docker&#29992;&#25143;&#32452;&#19981;&#26159;&#20010;&#22909;&#36873;&#25321;.org
&#20026;&#20160;&#20040;cat&#21629;&#20196;&#26597;&#30475;&#25991;&#20214;&#19981;&#20250;&#20462;&#25913;atime.org &#20026;Archlinux&#23433;&#35013;Android&#21452;&#21551;&#21160;.org
&#20026;history&#21152;&#19978;&#26102;&#38388;&#25139;.org &#20026;Linux&#23433;&#35013;&#26432;&#27602;&#36719;&#20214;.org
&#20026;OpenSSH&#24320;&#21551;&#21452;&#22240;&#32032;&#35748;&#35777;.org &#20026;urxvt&#35774;&#32622;&#32972;&#26223;&#22270;&#29255;.org
&#25105;&#30340;linux&#32456;&#31471;&#24037;&#20855;.org &#25105;&#25152;&#19981;&#30693;&#36947;&#30340;printf&#21629;&#20196;&#29305;&#24615;.org
&#35823;&#21024;&#38500;dev&#19979;&#29305;&#27530;&#25991;&#20214;&#24590;&#20040;&#21150;.org &#23567;&#25351;&#22836;&#30340;&#22937;&#29992;.org
&#20462;&#22797;passwd:Authentication token manipulation error&#30340;&#27493;&#39588;.org &#19968;&#20010;&#20998;&#26512;&#27491;&#21017;&#34920;&#36798;&#24335;&#30340;&#22909;&#32593;&#31449;.org
&#19968;&#20010;&#26174;&#31034;&#20013;&#25991;&#26684;&#35328;&#30340;fortune&#25991;&#20214;.org &#19968;&#20010;&#23398;&#20064;SQL&#30340;&#32593;&#31449;.org
&#19968;&#34892;&#21629;&#20196;&#25226;OrangePi&#25171;&#36896;&#25104;&#25991;&#20214;&#20113;&#26381;&#21153;&#22120;.org &#19968;&#34892;&#21629;&#20196;&#23454;&#29616;url decode.org
&#29992;mpg123&#25773;&#25918;https_url_mp3.org &#29992;Termux&#27169;&#25311;Ubuntu.org
&#36816;&#34892;tail|grep&#21518;&#25353;&#19979;Ctrl-C&#30340;&#36807;&#31243;&#20013;&#21457;&#29983;&#20102;&#20160;&#20040;.org &#22312;&#23481;&#22120;&#20013;&#36816;&#34892;Linux&#29256;&#30334;&#24230;&#20113;&#30424;&#23458;&#25143;&#31471;.org
&#22312;&#23481;&#22120;&#20013;&#36816;&#34892;Linux&#29256;QQ.org &#22312;archlinux&#23433;&#35013;&#37197;&#32622;VNC Server.org
&#22312;Archlinux&#19978;&#23433;&#35013;&#21644;&#20351;&#29992;Tripwire IDS.org &#22312;archlinux&#19978;&#23433;&#35013;deb&#21253;.org
&#22312;archlinux&#19978;&#25346;&#36733;virtualbox&#30913;&#30424;&#38236;&#20687;&#25991;&#20214;.org &#22312;Archlinux&#19978;&#36827;&#34892;&#26102;&#38047;&#21516;&#27493;.org
&#22312;Archlinux&#19979;&#23433;&#35013;&#21644;&#20351;&#29992;Skype.org &#22312;archlinux&#20013;&#20351;&#29992;&#34013;&#29273;&#32819;&#26426;.org
&#22312;docker&#23481;&#22120;&#20013;&#20998;&#20139;&#25935;&#24863;&#20449;&#24687;&#30340;&#26041;&#27861;.org &#22312;Docker&#20013;&#36816;&#34892;Steam.org
&#22312;DosBox&#19978;&#23433;&#35013;windows3.2.org &#22312;Linux&#19978;&#25645;&#24314;UO&#26381;&#21153;&#22120;.org
&#22312;OrangePi&#19978;&#23433;&#35013;Lychee&#36827;&#34892;&#29031;&#29255;&#31649;&#29702;.org &#22312;OrangePi&#19978;&#20351;&#29992;Docker-Compose&#25645;&#24314;&#34434;&#34433;&#31508;&#35760;&#26381;&#21153;&#22120;.org
&#22312;OrangePi&#19978;&#36816;&#34892;DOS&#31243;&#24207;.org &#22312;shell&#20013;&#24555;&#36895;&#36339;&#36716;&#21040;&#24120;&#29992;&#30446;&#24405;.org
&#22312;Termux&#20013;&#27169;&#25311;root.org &#22312;Ubuntu&#19978;&#23433;&#35013;RPM&#21253;.org
&#32456;&#31471;&#29615;&#22659;&#20351;&#29992;w3m&#35775;&#38382;&#35270;&#39057;&#31449;&#28857;&#30340;&#27491;&#30830;&#26041;&#24335;.org &#37325;&#24314;CentOS&#25110;RHEL&#19978;&#34987;&#25439;&#22351;&#30340;RPM&#25968;&#25454;&#24211;.org
&#23562;&#37325;&#38544;&#31169;&#30340;&#25628;&#32034;&#24341;&#25806;.org AIX&#34892;vi&#25171;&#24320;&#22823;&#25991;&#20214;&#26102;&#25552;&#31034;"Out of memory saving lines for undo"&#30340;&#35299;&#20915;&#26041;&#27861;.org
archlinux&#23433;&#35013;nvidia&#39537;&#21160;.org archlinux&#24320;&#21551;&#25351;&#32441;&#30331;&#38470;.org
archlinux&#22914;&#20309;&#38477;&#32423;&#23433;&#35013;&#36719;&#20214;&#21253;.org archlinux&#20351;&#29992;virtualbox&#30340;&#20960;&#20010;&#35201;&#28857;.org
awesomewm&#37197;&#32622;.org AwesomeWM&#20013;&#30340;client.org
Bash&#25361;&#25112;&#36187;.org bash&#20013;&#30340;&#25193;&#23637;&#36890;&#37197;&#31526;.org
Bash&#20013;&#30340;&#37027;&#20123;&#24555;&#25463;&#38190;.org Bash&#20013;&#30340;&#37027;&#20123;&#26377;&#36259;&#30340;&#20869;&#32622;&#21464;&#37327;.org
Bash&#20013;&#30340;keymap&#19982;bind&#21629;&#20196;.org Basic Setup and Installation of DosBox.org
bitlbee.org btrfs&#25991;&#20214;&#31995;&#32479;&#31649;&#29702;.org
cdspell&#24110;&#20320;&#33258;&#21160;&#26356;&#27491;cd&#21629;&#20196;&#20013;&#30340;&#38169;&#35823;&#30446;&#24405;.org control.tar.gz
ctop_manage_container.org curl&#32451;&#20064;.org
data.tar.xz deb&#25991;&#20214;&#30340;&#26684;&#24335;.org
debian-binary DeDRM_tools_6.6.1.zip
DICTD:&#26500;&#24314;&#33258;&#24049;&#30340;&#23383;&#20856;&#26381;&#21153;&#22120;.org docker&#23481;&#22120;&#20013;&#36305;GUI&#30340;&#26368;&#31616;&#21333;&#26041;&#27861;.org
docker-machine&#21021;&#20307;&#39564;.org ext4 tips&#19977;&#21017;.org
Firefox&#25552;&#31034;&#25554;&#20214;&#35748;&#35777;&#36807;&#26399;&#30340;&#35299;&#20915;&#26041;&#27861;.org Firefox&#19968;&#27425;&#20851;&#38381;&#22810;&#20010;&#26631;&#31614;&#39029;.org
funny-manpages.org git&#23548;&#20986;&#25490;&#38500;&#25351;&#23450;&#25991;&#20214;&#30340;&#26041;&#27861;.org
git&#32451;&#20064;.org git tips&#20043;&#21482;&#25552;&#20132;&#25991;&#20214;&#20013;&#30340;&#26576;&#20123;&#21464;&#26356;.org
GLOBIGNORE&#21464;&#37327;&#30340;&#24847;&#20041;.org grub2&#24120;&#29992;&#21629;&#20196;.org
images install:&#22686;&#24378;&#29256;&#30340;cp&#21629;&#20196;.org
kgotobed&#35753;&#20320;&#24378;&#21046;&#26089;&#30561;.org kile&#32534;&#35793;&#26102;&#25552;&#31034; ViewPDF failed to start&#30340;&#35299;&#20915;&#26041;&#27861;.org
linux&#23450;&#26102;&#20241;&#30496;.org Linux&#25346;&#36733;BitLocker&#21152;&#23494;&#30340;Windows&#20998;&#21306;.org
linux&#20869;&#23384;&#30340;&#20998;&#37197;&#21644;&#37322;&#25918;.org linux&#22914;&#20309;&#26356;&#25913;&#32593;&#21345;MAC&#22320;&#22336;.org
linux&#22914;&#20309;&#35774;&#32622;&#26102;&#21306;.org linux&#26159;&#22914;&#20309;&#35760;&#24405;&#26085;&#24535;&#30340;.org
Linux&#19979;&#30340;&#37027;&#20123;&#25945;&#32946;&#31867;&#36719;&#20214;&#38598;&#21512;.org linux&#19979;&#30340;SysRq&#38190;.org
linux&#19979;rar&#25991;&#20214;&#24120;&#29992;&#25805;&#20316;.org linux&#20013;&#32593;&#32476;&#30456;&#20851;&#30340;&#37027;&#20123;&#37197;&#32622;&#25991;&#20214;.org
linux&#37325;&#35201;&#26085;&#24535;&#35828;&#26126;.org linuxbrew&#35753;&#20320;&#22312;home&#30446;&#24405;&#19979;&#23433;&#35013;&#24212;&#29992;.org
linux IO&#23376;&#31995;&#32479;&#27010;&#35272;.org linux shell flock&#25991;&#20214;&#38145;&#30340;&#29992;&#27861;&#21450;&#27880;&#24847;&#20107;&#39033;.org
ls&#23545;&#25991;&#20214;&#36827;&#34892;&#25490;&#24207;.org MBR&#19982;GPT&#20998;&#21306;&#34920;&#30340;&#31616;&#21333;&#35828;&#26126;.org
meminfo&#25991;&#20214;&#35814;&#35299;.org mpg123&#25773;&#25918;&#27468;&#26354;&#33258;&#21160;&#24555;&#36827;&#30340;&#35299;&#20915;&#26041;&#27861;.org
Newsboat&#65306;&#19968;&#27454;&#32456;&#31471;RSS&#38405;&#35835;&#22120;.org nohup,setsid&#19982;disown&#30340;&#19981;&#21516;&#20043;&#22788;.org
numfmt:&#35753;&#25968;&#23383;&#21464;&#24471;&#26356;&#23481;&#26131;&#29702;&#35299;.org pacman&#20013;&#30340;Pac-Man.org
pamac:&#35753;&#20320;&#36731;&#26494;&#31649;&#29702;&#36719;&#20214;&#21253;.org peek:&#19968;&#27454;&#31616;&#26131;&#30340;gif&#24405;&#23631;&#36719;&#20214;.org
reinstall-arch.org rox-filer&#24120;&#29992;&#25805;&#20316;.org
SDCV:&#32456;&#31471;&#19978;&#30340;&#26143;&#38469;&#35793;&#29579;.org sed&#20013;&#30340;alpha&#21040;&#24213;&#21253;&#21547;&#21738;&#20123;&#23383;&#31526;.org
shell&#20013;&#30340;&#37027;&#20123;&#21021;&#22987;&#21270;&#25991;&#20214;.org shell&#20013;&#22914;&#20309;&#23558;&#20854;&#20182;&#36827;&#21046;&#25968;&#36716;&#25442;&#25104;10&#36827;&#21046;&#25968;.org
sl-modem-daemon_2.9.11~20110321-12_i386.deb ssh&#31471;&#21475;&#36716;&#21457;&#35828;&#26126;.org
ssh&#20351;&#29992;&#36339;&#26495;&#26426;&#35775;&#38382;&#36828;&#31243;&#26381;&#21153;&#22120;.org ssh&#36828;&#31243;&#25191;&#34892;&#33050;&#26412;&#21518;&#26080;&#36820;&#22238;&#30340;&#35299;&#20915;&#26041;&#27861;.org
sshtron&#35753;&#20320;&#22312;&#32456;&#31471;&#29609;&#30340;&#22810;&#20154;&#36138;&#21507;&#34503;.org termux-api&#35753;&#20320;&#30340;Termux&#35775;&#38382;&#25163;&#26426;&#31995;&#32479;&#21151;&#33021;.org
tload:&#23383;&#31526;&#30028;&#38754;&#19978;&#30340;&#22270;&#24418;&#21270;&#31995;&#32479;&#36127;&#36733;&#30417;&#25511;&#24037;&#20855;.org Tmux&#24120;&#29992;&#25805;&#20316;&#35828;&#26126;.org
Ubuntu16.04&#21319;&#32423;&#21040;18.04&#30340;&#27493;&#39588;.org Ubuntu&#20351;&#29992;apt&#23433;&#35013;&#26412;&#22320;deb&#36719;&#20214;&#21253;.org
unzip&#24120;&#29992;&#26041;&#27861;.org urandom&#21644;random&#35774;&#22791;&#30340;&#21306;&#21035;.org
Vagrant&#20351;&#29992;&#25351;&#21335;.org w3m&#24120;&#29992;&#25805;&#20316;.org
what-is-double-slash-foo-directory.org wsl&#25163;&#24037;&#25346;&#36733;U&#30424;.org
xfs&#25991;&#20214;&#31995;&#32479;&#31649;&#29702;.org xterm&#20351;&#29992;&#31616;&#20171;.org
yum&#25552;&#31034;&#8220;DB_RUNRECOVERY Fatal error, run database recovery&#8221;&#30340;&#35299;&#20915;&#26041;&#26696;.org z.sh
</pre>
</div>
</div>
</div>
